## Numero establecimientos 2011
En este notebook procesaremos un .xlsx con el número de establecimientos desagregado por municipios y por tipos de negocio: agricultura, industria, construcción y servicios. 

Obtendremos un DataFrame con la siguiente información:
- Codigo Municipio
- Nº establecimientos Agricultura
- Nº establecimientos Industria
- Nº establecimientos Construccion
- Nº establecimientos Servicios

In [1]:
import pandas as pd
import numpy as np

In [2]:
NumeroEstablecimientos11 = pd.read_excel('09_Input_Numero_Establecimientos_11.xlsx', dtype={'Codigo' : str})
NumeroEstablecimientos11.head()

   Código          Etiqueta Agricultura Industria Construcción  Servicios
0    1001  Alegría-Dulantzi           0        17            12        62
1    1002           Amurrio           8        61            33       261
2    1003           Aramaio           3         4             3        12
3    1004        Artziniega           1        10             5        31
4    1006           Armiñón           0         3             0         4

In [3]:
NumeroEstablecimientos11.drop('Etiqueta', axis = 1, inplace = True)
NumeroEstablecimientos11.rename({'Código' : 'Codigo Municipio',
                                'Agricultura' : 'Nº Establecimientos Agricultura',
                                'Industria' : 'Nº Establecimientos Industria',
                                'Construcción ' : 'Nº Establecimientos Construccion', 
                                'Servicios' : 'Nº Establecimientos Servicios'}, axis = 1, inplace = True)
NumeroEstablecimientos11.head()

,Codigo Municipio,Nº Establecimientos Agricultura,Nº Establecimientos Industria,Nº Establecimientos Construccion,Nº Establecimientos Servicios
0,1001,0,17,12,62
1,1002,8,61,33,261
2,1003,3,4,3,12
3,1004,1,10,5,31
4,1006,0,3,0,4

Algunas variables toman el valor: N/A - resultado no disponible  
Lo substituimos por NaN:

In [4]:
NumeroEstablecimientos11.replace('N/A - resultado no disponible', np.nan, inplace = True)

In [5]:
NumeroEstablecimientos11.to_csv('09_Output_Numero_Establecimientos_11.csv', header = True, index = False)